[English]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing.
Please follow the steps below for pairing. = Please follow the steps below for pairing.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Set the connection switch to the RF 2.4GHz mode.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Press and hold the left button, right button and DPI button for 3 seconds.
3. Click the "Pair" button on the interface. = 3. Click the "Pair" button on the interface.	
1. Connect the device to your computer with the USB cable. = 1. Connect the device to your computer with the USB cable.
2. Click the "Pair" button on the interface. = 2. Click the "Pair" button on the interface.

Pair = Pair
Close = Close
Pairing = Pairing
Pairing completed = Pairing completed
Pairing failed = Pairing failed

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Connect the device to your computer with a USB cable and set the connection switch to RF 2.4GHz mode.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Press and hold the function button for 15 seconds until you hear audible prompts.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Please unplug and reinsert the RF 2.4 GHz receiver. Power off the device, and then switch the device to RF 2.4 GHz mode.